/*
 * 1. 完成教材P31习题2中的一、3和一、4，并将其编译运行，以测试你所写的结果是否正确
 *    （注：程序文件分别命名为P31_1_3.c和P31_1_4.c）。
 *
 * 2. 完成教材P31习题2中的二、4（注：请写出完整的可编译运行的程序，并多次修改变量
 *    x、a、b、c的值，以测试你所写出的表达式是否正确；
 *    程序文件分别命名为P31_2_4_1.c和P31_2_4_2.c）。
 *
 * 3. 理解前置自增/自减操作符与后置自增/自减操作符的异同（注：无须写程序）。
 *
 * 4. 阅读The C Programming Language一书2.9节，初步理解各种位运算操作符，及其使用技巧。
 *
 * 5. 如下图（图见PDF），去掉注释，在TODO的位置填写一个表达式，这个表达式的作用是判断一个整数的奇偶性。
 *    使得当n为奇数时，flag为1；当n为偶数时，flag为0。编译运行，并多次修改n的值，
 *    以测试你所写的表达式是否正确。（注：程序文件命名为parity.c；提示：使用位运算）。
 *
 * 6. 补充练习：完成The C Programming Language一书Exercise2-6,2-7,2-8。
 *    （注：程序文件分别命名为tcpl_2_6.c，tcpl_2_7.c，tcpl_2_8.c）。
 * 
 * 7. 补充阅读：Bitwise Operation: https://en.wikipedia.org/wiki/Bitwise_operation。
 */
